# Type Casting

Pandas’ astype() function used to change the data typ.

In [2]:
import pandas as pd
d = {'A_Num' : [10,20,30],'B_Cat' : ['a','b','c'],'C_Float':[1.0,2.0,3.0]}
df = pd.DataFrame(d)
df

   A_Num B_Cat  C_Float
0     10     a      1.0
1     20     b      2.0
2     30     c      3.0

In [3]:
#Pandas df.dtypes attribute is used to get the data type of each column of DataFrame.
df.dtypes

A_Num        int64
B_Cat       object
C_Float    float64
dtype: object

In [4]:
df['C'] = df['C_Float'].astype('int')  # Change Data type of column C_Float to integer
df['C'].dtypes

dtype('int32')

In [5]:
df['A'] = df['A_Num'].astype('str')  # Change Data type of column A_Num to string
df.dtypes

A_Num        int64
B_Cat       object
C_Float    float64
C            int32
A           object
dtype: object

# Change the data type to numeric
panda.to_numeric() method used to change the data type to numeric type.

pd.to_numeric(arg, errors, downcast)

arg      - scalar, list, tuple, 1-d array, or Series

errors   - {‘ignore’, ‘raise’, ‘coerce’}, default ‘raise’

          'raise' : invalid parsing will raise an exception
        
          ‘coerce’: invalid parsing will be set as NaN
                
          ‘ignore’: invalid parsing will return the input
        
downcast - {‘integer’, ‘signed’, ‘unsigned’, ‘float’} , default None

In [6]:
df = pd.DataFrame({'A' : [10,20,'x'],'B' : ['a','b','c'],'C':['1','2','3']})
pd.to_numeric(df['C'])

0    1
1    2
2    3
Name: C, dtype: int64

In [7]:
df

    A  B  C
0  10  a  1
1  20  b  2
2   x  c  3

# Selecting columns based on data types

Pandas’ select_dtypes method used to select specific columns based on dtypes. 

You need to specify the data types in include/exclude parameter, which you want to select.

In [9]:
df = pd.DataFrame({'A' : [True,True,False],'B' : [1.2,3.5,9.0],'C':[1,2,3]})
df

       A    B  C
0   True  1.2  1
1   True  3.5  2
2  False  9.0  3

In [10]:
df.select_dtypes(include='int')

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [11]:
df.select_dtypes(include='number')

     B  C
0  1.2  1
1  3.5  2
2  9.0  3

In [12]:
df.select_dtypes(include='number',exclude="float")

   C
0  1
1  2
2  3